{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "1× Assembler · 2.5/min of 12.5 needed"
			},
			"Translation":
			{
				"Text": "1× Assembler · 2.5/min of 12.5 needed"
			},
			"Key": "AB46CACF4C402D0A0C2BBD8FB7B2500A"
		},
		{
			"Source":
			{
				"Text": "1× Manufacturer · 2.5/min"
			},
			"Translation":
			{
				"Text": "1× Manufacturer · 2.5/min"
			},
			"Key": "3AE89A3A41716D0C1158828D998F52A4"
		},
		{
			"Source":
			{
				"Text": "2,000 needed  ·  2,000 banked  ·  deliver now"
			},
			"Translation":
			{
				"Text": "2,000 needed  ·  2,000 banked  ·  deliver now"
			},
			"Key": "650C25414036AC525E39C79183343F3B"
		},
		{
			"Source":
			{
				"Text": "2× Assembler · 25/min"
			},
			"Translation":
			{
				"Text": "2× Assembler · 25/min"
			},
			"Key": "FE02FE6043275C5F429266A6F006A805"
		},
		{
			"Source":
			{
				"Text": "2× Manufacturer · 5.0/min"
			},
			"Translation":
			{
				"Text": "2× Manufacturer · 5.0/min"
			},
			"Key": "9614FDD644BF8B9EE29DE8A6D6732B2C"
		},
		{
			"Source":
			{
				"Text": "3 parts required  ·  1 ready to deliver  ·  1 blocked  ·  earliest completion ~72 min"
			},
			"Translation":
			{
				"Text": "3 parts required  ·  1 ready to deliver  ·  1 blocked  ·  earliest completion ~72 min"
			},
			"Key": "7F101E664166DBC1D99692B19B5313F2"
		},
		{
			"Source":
			{
				"Text": "480 needed  ·  120 banked  ·  360 to produce  ·  ~72 min"
			},
			"Translation":
			{
				"Text": "480 needed  ·  120 banked  ·  360 to produce  ·  ~72 min"
			},
			"Key": "E8ACA03D49EB7261E197659531E32B6F"
		},
		{
			"Source":
			{
				"Text": "99 needed  ·  7 banked  ·  92 to produce  ·  blocked"
			},
			"Translation":
			{
				"Text": "99 needed  ·  7 banked  ·  92 to produce  ·  blocked"
			},
			"Key": "3BE554254D343A7BBCA2B7B5A00AF90C"
		},
		{
			"Source":
			{
				"Text": "Adaptive Control Unit"
			},
			"Translation":
			{
				"Text": "Adaptive Control Unit"
			},
			"Key": "08EBECCB41804E37453A4AAA1FD5F3E3"
		},
		{
			"Source":
			{
				"Text": "Automated Wiring"
			},
			"Translation":
			{
				"Text": "Automated Wiring"
			},
			"Key": "9EF74FE34AE569C38CA64E9D82C844A8"
		},
		{
			"Source":
			{
				"Text": "CRITICAL PATH"
			},
			"Translation":
			{
				"Text": "CRITICAL PATH"
			},
			"Key": "043B5BBC45C8B0568744889832C5FD6B"
		},
		{
			"Source":
			{
				"Text": "Modular Engine"
			},
			"Translation":
			{
				"Text": "Modular Engine"
			},
			"Key": "E3B96B684DA94C6196E53B9E5EF65A3E"
		},
		{
			"Source":
			{
				"Text": "Space Elevator: Main Body"
			},
			"Translation":
			{
				"Text": "Space Elevator: Main Body"
			},
			"Key": "2523207949D893471F1C63BF2314EACE"
		},
		{
			"Source":
			{
				"Text": "Stator"
			},
			"Translation":
			{
				"Text": "Stator"
			},
			"Key": "F616D3404E39FA0AE068C5AD74FA8243"
		},
		{
			"Source":
			{
				"Text": "Versatile Framework"
			},
			"Translation":
			{
				"Text": "Versatile Framework"
			},
			"Key": "73F3C0684140FD63EC7EBF898F7BE8AD"
		},
		{
			"Source":
			{
				"Text": "no producer configured"
			},
			"Translation":
			{
				"Text": "no producer configured"
			},
			"Key": "B4DE02E8428694AE136D48822BF08AE1"
		},
		{
			"Source":
			{
				"Text": "×"
			},
			"Translation":
			{
				"Text": "×"
			},
			"Key": "1A0751FB44AC4366F8DF2BBCAF1BFF20"
		},
		{
			"Source":
			{
				"Text": "× BLOCKED — Adaptive Control Unit is stalled. Build a Stator line: it gates Automated Wiring → Adaptive Control Unit → Main Body."
			},
			"Translation":
			{
				"Text": "× BLOCKED — Adaptive Control Unit is stalled. Build a Stator line: it gates Automated Wiring → Adaptive Control Unit → Main Body."
			},
			"Key": "C00C970340D208F8A377D2B6647BE15D"
		},
		{
			"Source":
			{
				"Text": "■"
			},
			"Translation":
			{
				"Text": "■"
			},
			"Key": "916D7FF44FD10ADF39543CA075B7F49A"
		},
		{
			"Source":
			{
				"Text": "▲"
			},
			"Translation":
			{
				"Text": "▲"
			},
			"Key": "B93CDE3745A0108F118915A3EB4B3B18"
		},
		{
			"Source":
			{
				"Text": "▲"
			},
			"Translation":
			{
				"Text": "▲"
			},
			"Key": "3D920FAE42B1D930C642E6933107B5CB"
		},
		{
			"Source":
			{
				"Text": "●"
			},
			"Translation":
			{
				"Text": "●"
			},
			"Key": "29308E89411226D839FFDD9CFE508DF0"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "CriticalPath",
			"Children": [
				{
					"Source":
					{
						"Text": "  ·  nearest endpoint {0} m away"
					},
					"Translation":
					{
						"Text": "  ·  nearest endpoint {0} m away"
					},
					"Key": "BalanceDistanceFmt"
				},
				{
					"Source":
					{
						"Text": "ALL AUGMENTS"
					},
					"Translation":
					{
						"Text": "ALL AUGMENTS"
					},
					"Key": "BalanceAugmentAll"
				},
				{
					"Source":
					{
						"Text": "ALL LINES"
					},
					"Translation":
					{
						"Text": "ALL LINES"
					},
					"Key": "BalanceProblemAll"
				},
				{
					"Source":
					{
						"Text": "AT FULL SPEED  needs {0}  ·  ingredients allow {1}  ·  would deliver {2}"
					},
					"Translation":
					{
						"Text": "AT FULL SPEED  needs {0}  ·  ingredients allow {1}  ·  would deliver {2}"
					},
					"Key": "BalanceDesignFmt"
				},
				{
					"Source":
					{
						"Text": "AWESOME Shop"
					},
					"Translation":
					{
						"Text": "AWESOME Shop"
					},
					"Key": "SrcShop"
				},
				{
					"Source":
					{
						"Text": "Across the whole factory only {0}/min is available against {1}/min needed ({2}%) - this may be a different line"
					},
					"Translation":
					{
						"Text": "Across the whole factory only {0}/min is available against {1}/min needed ({2}%) - this may be a different line"
					},
					"Key": "LimiterNetFmt"
				},
				{
					"Source":
					{
						"Text": "Already produced"
					},
					"Translation":
					{
						"Text": "Already produced"
					},
					"Key": "PlanGraft"
				},
				{
					"Source":
					{
						"Text": "Already produced - {0}"
					},
					"Translation":
					{
						"Text": "Already produced - {0}"
					},
					"Key": "PlanGraftFmt"
				},
				{
					"Source":
					{
						"Text": "Arriving ingredients only support {0} of the {1} these machines could make"
					},
					"Translation":
					{
						"Text": "Arriving ingredients only support {0} of the {1} these machines could make"
					},
					"Key": "LimiterInputConstraintFmt"
				},
				{
					"Source":
					{
						"Text": "Asking the host for a report"
					},
					"Translation":
					{
						"Text": "Asking the host for a report"
					},
					"Key": "AskingHostHeadline"
				},
				{
					"Source":
					{
						"Text": "Assumed recipe: {0}"
					},
					"Translation":
					{
						"Text": "Assumed recipe: {0}"
					},
					"Key": "PlanTipFmt"
				},
				{
					"Source":
					{
						"Text": "A–Z"
					},
					"Translation":
					{
						"Text": "A–Z"
					},
					"Key": "BalanceSortAlphabetical"
				},
				{
					"Source":
					{
						"Text": "BALANCE"
					},
					"Translation":
					{
						"Text": "BALANCE"
					},
					"Key": "TabBalance"
				},
				{
					"Source":
					{
						"Text": "BELT JAMMED · {0} machine(s) blocked by {1} on the feeding belt - remove it; this is not a supply shortage"
					},
					"Translation":
					{
						"Text": "BELT JAMMED · {0} machine(s) blocked by {1} on the feeding belt - remove it; this is not a supply shortage"
					},
					"Key": "BalanceJammedFmt"
				},
				{
					"Source":
					{
						"Text": "BLOCKED - the plan ({0} step(s)):"
					},
					"Translation":
					{
						"Text": "BLOCKED - the plan ({0} step(s)):"
					},
					"Key": "VerdictPlanBlockedFmt"
				},
				{
					"Source":
					{
						"Text": "BLOCKED - {0} step(s) to deliver {1}"
					},
					"Translation":
					{
						"Text": "BLOCKED - {0} step(s) to deliver {1}"
					},
					"Key": "VerdictPlanBlockedDeliverFmt"
				},
				{
					"Source":
					{
						"Text": "BLOCKED - {0}: {1}."
					},
					"Translation":
					{
						"Text": "BLOCKED - {0}: {1}."
					},
					"Key": "VerdictBlockedFmt"
				},
				{
					"Source":
					{
						"Text": "BUFFER  {0} {1} reachable"
					},
					"Translation":
					{
						"Text": "BUFFER  {0} {1} reachable"
					},
					"Key": "BufferAmountFmt"
				},
				{
					"Source":
					{
						"Text": "BUFFER  {0} {1} reachable  ·  about {2} min at the current shortfall"
					},
					"Translation":
					{
						"Text": "BUFFER  {0} {1} reachable  ·  about {2} min at the current shortfall"
					},
					"Key": "BufferRunwayFmt"
				},
				{
					"Source":
					{
						"Text": "BUILT CAPACITY"
					},
					"Translation":
					{
						"Text": "BUILT CAPACITY"
					},
					"Key": "BalanceInstalled"
				},
				{
					"Source":
					{
						"Text": "Belt bottleneck: {0} → {1} carries {2} of {3}"
					},
					"Translation":
					{
						"Text": "Belt bottleneck: {0} → {1} carries {2} of {3}"
					},
					"Key": "LimiterBeltConstraintFmt"
				},
				{
					"Source":
					{
						"Text": "Bottleneck: {0}"
					},
					"Translation":
					{
						"Text": "Bottleneck: {0}"
					},
					"Key": "LimiterNameFmt"
				},
				{
					"Source":
					{
						"Text": "CLEAR PINGS"
					},
					"Translation":
					{
						"Text": "CLEAR PINGS"
					},
					"Key": "ClearPings"
				},
				{
					"Source":
					{
						"Text": "COLLECTED IN THE WORLD · no machine makes this; {0} is drawn from what you carry in and store"
					},
					"Translation":
					{
						"Text": "COLLECTED IN THE WORLD · no machine makes this; {0} is drawn from what you carry in and store"
					},
					"Key": "BalanceWorldGatheredFmt"
				},
				{
					"Source":
					{
						"Text": "CONSUMER NEED"
					},
					"Translation":
					{
						"Text": "CONSUMER NEED"
					},
					"Key": "BalanceDemand"
				},
				{
					"Source":
					{
						"Text": "CONSUMERS"
					},
					"Translation":
					{
						"Text": "CONSUMERS"
					},
					"Key": "BalanceConsumersHeading"
				},
				{
					"Source":
					{
						"Text": "CONSUMERS STOPPED · {0} machine(s) here would use {1}, but none of them are running"
					},
					"Translation":
					{
						"Text": "CONSUMERS STOPPED · {0} machine(s) here would use {1}, but none of them are running"
					},
					"Key": "BalanceConsumersStoppedFmt"
				},
				{
					"Source":
					{
						"Text": "CONSUMERS STOPPED · {0} machine(s) here would use {1}, but their own output is backed up"
					},
					"Translation":
					{
						"Text": "CONSUMERS STOPPED · {0} machine(s) here would use {1}, but their own output is backed up"
					},
					"Key": "BalanceConsumersBlockedFmt"
				},
				{
					"Source":
					{
						"Text": "CRITICAL PATH"
					},
					"Translation":
					{
						"Text": "CRITICAL PATH"
					},
					"Key": "PanelTitle"
				},
				{
					"Source":
					{
						"Text": "Checking your factory…"
					},
					"Translation":
					{
						"Text": "Checking your factory…"
					},
					"Key": "BalancePending"
				},
				{
					"Source":
					{
						"Text": "Click to show/hide the blocker chain"
					},
					"Translation":
					{
						"Text": "Click to show/hide the blocker chain"
					},
					"Key": "TipChainHint"
				},
				{
					"Source":
					{
						"Text": "Could not measure what is arriving - check the belts and pipes feeding this"
					},
					"Translation":
					{
						"Text": "Could not measure what is arriving - check the belts and pipes feeding this"
					},
					"Key": "BlockSolvedConnectivityUnknown"
				},
				{
					"Source":
					{
						"Text": "Critical Path could not find a player to ask the host on behalf of."
					},
					"Translation":
					{
						"Text": "Critical Path could not find a player to ask the host on behalf of."
					},
					"Key": "NoControllerDetail"
				},
				{
					"Source":
					{
						"Text": "Current milestone is fully paid - collect it and select the next one at the HUB."
					},
					"Translation":
					{
						"Text": "Current milestone is fully paid - collect it and select the next one at the HUB."
					},
					"Key": "MilestonePaid"
				},
				{
					"Source":
					{
						"Text": "DRAWN FROM STORAGE · nothing is making this; the {0} you have banked covers about {1} min at this rate"
					},
					"Translation":
					{
						"Text": "DRAWN FROM STORAGE · nothing is making this; the {0} you have banked covers about {1} min at this rate"
					},
					"Key": "BalanceStockedByHandRunwayFmt"
				},
				{
					"Source":
					{
						"Text": "DRAWN FROM STORAGE · nothing is making this; {0} banked is all there is"
					},
					"Translation":
					{
						"Text": "DRAWN FROM STORAGE · nothing is making this; {0} banked is all there is"
					},
					"Key": "BalanceStockedByHandFmt"
				},
				{
					"Source":
					{
						"Text": "Delivered"
					},
					"Translation":
					{
						"Text": "Delivered"
					},
					"Key": "StatusDelivered"
				},
				{
					"Source":
					{
						"Text": "Delivered: all {0}"
					},
					"Translation":
					{
						"Text": "Delivered: all {0}"
					},
					"Key": "TipDeliveredFmt"
				},
				{
					"Source":
					{
						"Text": "Delivery rates are not available right now. Machine status and built capacity are shown below."
					},
					"Translation":
					{
						"Text": "Delivery rates are not available right now. Machine status and built capacity are shown below."
					},
					"Key": "BalanceUnknown"
				},
				{
					"Source":
					{
						"Text": "EST. CURRENT OUTPUT"
					},
					"Translation":
					{
						"Text": "EST. CURRENT OUTPUT"
					},
					"Key": "BalanceEstimatedOutput"
				},
				{
					"Source":
					{
						"Text": "EST. CURRENT USE"
					},
					"Translation":
					{
						"Text": "EST. CURRENT USE"
					},
					"Key": "BalanceEstimatedUse"
				},
				{
					"Source":
					{
						"Text": "Elevator"
					},
					"Translation":
					{
						"Text": "Elevator"
					},
					"Key": "SectionElevatorNone"
				},
				{
					"Source":
					{
						"Text": "Elevator: {0}"
					},
					"Translation":
					{
						"Text": "Elevator: {0}"
					},
					"Key": "SectionElevatorFmt"
				},
				{
					"Source":
					{
						"Text": "Every production line in your factory, lines feeding your objective first: what it makes, what arrives, and how long your stock lasts."
					},
					"Translation":
					{
						"Text": "Every production line in your factory, lines feeding your objective first: what it makes, what arrives, and how long your stock lasts."
					},
					"Key": "BalanceIntro"
				},
				{
					"Source":
					{
						"Text": "Extraction {0}/min vs demand {1}/min - add or upgrade extractors"
					},
					"Translation":
					{
						"Text": "Extraction {0}/min vs demand {1}/min - add or upgrade extractors"
					},
					"Key": "BlockExtractFmt"
				},
				{
					"Source":
					{
						"Text": "HUB"
					},
					"Translation":
					{
						"Text": "HUB"
					},
					"Key": "SrcTutorial"
				},
				{
					"Source":
					{
						"Text": "It is being made, but no belt or pipe connects it to what needs it"
					},
					"Translation":
					{
						"Text": "It is being made, but no belt or pipe connects it to what needs it"
					},
					"Key": "BlockNotConnected"
				},
				{
					"Source":
					{
						"Text": "JAMMED"
					},
					"Translation":
					{
						"Text": "JAMMED"
					},
					"Key": "BalanceProblemJammed"
				},
				{
					"Source":
					{
						"Text": "LOCATE"
					},
					"Translation":
					{
						"Text": "LOCATE"
					},
					"Key": "LocateEndpoint"
				},
				{
					"Source":
					{
						"Text": "LOCATE CONSUMER"
					},
					"Translation":
					{
						"Text": "LOCATE CONSUMER"
					},
					"Key": "LocateConsumer"
				},
				{
					"Source":
					{
						"Text": "LOCATE PRODUCER"
					},
					"Translation":
					{
						"Text": "LOCATE PRODUCER"
					},
					"Key": "LocateProducer"
				},
				{
					"Source":
					{
						"Text": "Line exists but is STOPPED - fix it"
					},
					"Translation":
					{
						"Text": "Line exists but is STOPPED - fix it"
					},
					"Key": "PlanGraftStopped"
				},
				{
					"Source":
					{
						"Text": "Line exists but is STOPPED - fix the {0}"
					},
					"Translation":
					{
						"Text": "Line exists but is STOPPED - fix the {0}"
					},
					"Key": "PlanGraftStoppedFmt"
				},
				{
					"Source":
					{
						"Text": "MACHINE STATUS ONLY · delivery rates are not available right now"
					},
					"Translation":
					{
						"Text": "MACHINE STATUS ONLY · delivery rates are not available right now"
					},
					"Key": "BalancePartialEvidence"
				},
				{
					"Source":
					{
						"Text": "MACHINES RUNNING SLOW · using about {0} of {1}; {2} machine(s) are short of ingredients"
					},
					"Translation":
					{
						"Text": "MACHINES RUNNING SLOW · using about {0} of {1}; {2} machine(s) are short of ingredients"
					},
					"Key": "BalanceObservedUseGapFmt"
				},
				{
					"Source":
					{
						"Text": "MAM"
					},
					"Translation":
					{
						"Text": "MAM"
					},
					"Key": "SrcMAM"
				},
				{
					"Source":
					{
						"Text": "MISSING INPUT"
					},
					"Translation":
					{
						"Text": "MISSING INPUT"
					},
					"Key": "BalanceProblemStarved"
				},
				{
					"Source":
					{
						"Text": "Machine contents and storage are tracked by the host, so Critical Path is requesting the report from there. This can take a few seconds on a large factory."
					},
					"Translation":
					{
						"Text": "Machine contents and storage are tracked by the host, so Critical Path is requesting the report from there. This can take a few seconds on a large factory."
					},
					"Key": "AskingHostDetail"
				},
				{
					"Source":
					{
						"Text": "Machines here can make {0}; the machines using it need {1}"
					},
					"Translation":
					{
						"Text": "Machines here can make {0}; the machines using it need {1}"
					},
					"Key": "LimiterInstalledConstraintFmt"
				},
				{
					"Source":
					{
						"Text": "Milestone"
					},
					"Translation":
					{
						"Text": "Milestone"
					},
					"Key": "SectionMilestoneNone"
				},
				{
					"Source":
					{
						"Text": "Milestone: {0}"
					},
					"Translation":
					{
						"Text": "Milestone: {0}"
					},
					"Key": "SectionMilestoneFmt"
				},
				{
					"Source":
					{
						"Text": "NEED FIRST"
					},
					"Translation":
					{
						"Text": "NEED FIRST"
					},
					"Key": "BalanceSortNeedFirst"
				},
				{
					"Source":
					{
						"Text": "NEEDS ATTENTION"
					},
					"Translation":
					{
						"Text": "NEEDS ATTENTION"
					},
					"Key": "BalanceProblemAttention"
				},
				{
					"Source":
					{
						"Text": "NEXT - {0}: {1}."
					},
					"Translation":
					{
						"Text": "NEXT - {0}: {1}."
					},
					"Key": "VerdictNextFmt"
				},
				{
					"Source":
					{
						"Text": "NEXT STEPS - the plan ({0} step(s)):"
					},
					"Translation":
					{
						"Text": "NEXT STEPS - the plan ({0} step(s)):"
					},
					"Key": "VerdictPlanHeadFmt"
				},
				{
					"Source":
					{
						"Text": "NEXT STEPS - {0} step(s) to deliver {1}"
					},
					"Translation":
					{
						"Text": "NEXT STEPS - {0} step(s) to deliver {1}"
					},
					"Key": "VerdictPlanDeliverFmt"
				},
				{
					"Source":
					{
						"Text": "NO POWER"
					},
					"Translation":
					{
						"Text": "NO POWER"
					},
					"Key": "BalanceProblemNoPower"
				},
				{
					"Source":
					{
						"Text": "NOT ENOUGH ARRIVING · {0} is getting through; {1} is needed"
					},
					"Translation":
					{
						"Text": "NOT ENOUGH ARRIVING · {0} is getting through; {1} is needed"
					},
					"Key": "BalanceModeledDeliveryGapFmt"
				},
				{
					"Source":
					{
						"Text": "NOT ENOUGH MACHINES · build at least {0} more production"
					},
					"Translation":
					{
						"Text": "NOT ENOUGH MACHINES · build at least {0} more production"
					},
					"Key": "BalanceCapacityGapFmt"
				},
				{
					"Source":
					{
						"Text": "NOT ENOUGH MACHINES · {0} short, and some machines are stopped as well"
					},
					"Translation":
					{
						"Text": "NOT ENOUGH MACHINES · {0} short, and some machines are stopped as well"
					},
					"Key": "BalanceCapacityMachineGapsFmt"
				},
				{
					"Source":
					{
						"Text": "NOT REACHING THE MACHINES · {0} producer(s) backed up while {1} consumer(s) sit starved - this is routing, not capacity"
					},
					"Translation":
					{
						"Text": "NOT REACHING THE MACHINES · {0} producer(s) backed up while {1} consumer(s) sit starved - this is routing, not capacity"
					},
					"Key": "BalanceDistributionFmt"
				},
				{
					"Source":
					{
						"Text": "NOTHING IS USING THIS · it is only filling storage right now"
					},
					"Translation":
					{
						"Text": "NOTHING IS USING THIS · it is only filling storage right now"
					},
					"Key": "BalanceNoDemand"
				},
				{
					"Source":
					{
						"Text": "Needs a fix"
					},
					"Translation":
					{
						"Text": "Needs a fix"
					},
					"Key": "StatusNeedsFix"
				},
				{
					"Source":
					{
						"Text": "No balance rows match this filter."
					},
					"Translation":
					{
						"Text": "No balance rows match this filter."
					},
					"Key": "BalanceNoMatches"
				},
				{
					"Source":
					{
						"Text": "No inputs arriving (check connections and supply)"
					},
					"Translation":
					{
						"Text": "No inputs arriving (check connections and supply)"
					},
					"Key": "BlockInputsStarved"
				},
				{
					"Source":
					{
						"Text": "No inputs arriving - {0} of {1} machine(s) starved (check connections and supply)"
					},
					"Translation":
					{
						"Text": "No inputs arriving - {0} of {1} machine(s) starved (check connections and supply)"
					},
					"Key": "BlockInputsStarvedFmt"
				},
				{
					"Source":
					{
						"Text": "No known source"
					},
					"Translation":
					{
						"Text": "No known source"
					},
					"Key": "PlanUnknown"
				},
				{
					"Source":
					{
						"Text": "No line - build one"
					},
					"Translation":
					{
						"Text": "No line - build one"
					},
					"Key": "PlanLine"
				},
				{
					"Source":
					{
						"Text": "No line - build: {0}"
					},
					"Translation":
					{
						"Text": "No line - build: {0}"
					},
					"Key": "PlanLineFmt"
				},
				{
					"Source":
					{
						"Text": "No line feeding your objective is in this state ({0}). Nothing to fix here."
					},
					"Translation":
					{
						"Text": "No line feeding your objective is in this state ({0}). Nothing to fix here."
					},
					"Key": "BalanceNoProblemMatches"
				},
				{
					"Source":
					{
						"Text": "No line feeding your objective matches this filter."
					},
					"Translation":
					{
						"Text": "No line feeding your objective matches this filter."
					},
					"Key": "BalanceNoMatchesSearch"
				},
				{
					"Source":
					{
						"Text": "No machine can make this - you collect it out in the world and carry it back"
					},
					"Translation":
					{
						"Text": "No machine can make this - you collect it out in the world and carry it back"
					},
					"Key": "BlockWorldGathered"
				},
				{
					"Source":
					{
						"Text": "No milestone selected - {0} available. Choose one at the HUB."
					},
					"Translation":
					{
						"Text": "No milestone selected - {0} available. Choose one at the HUB."
					},
					"Key": "MilestoneNoneSelectedFmt"
				},
				{
					"Source":
					{
						"Text": "No milestones available in this elevator phase."
					},
					"Translation":
					{
						"Text": "No milestones available in this elevator phase."
					},
					"Key": "MilestoneNoneAvailable"
				},
				{
					"Source":
					{
						"Text": "No outstanding Space Elevator phase."
					},
					"Translation":
					{
						"Text": "No outstanding Space Elevator phase."
					},
					"Key": "ElevatorNone"
				},
				{
					"Source":
					{
						"Text": "No outstanding objectives."
					},
					"Translation":
					{
						"Text": "No outstanding objectives."
					},
					"Key": "VerdictNone"
				},
				{
					"Source":
					{
						"Text": "No power - {0} of {1} machine(s) dark"
					},
					"Translation":
					{
						"Text": "No power - {0} of {1} machine(s) dark"
					},
					"Key": "BlockNoPowerCountFmt"
				},
				{
					"Source":
					{
						"Text": "No recipe by design - spent fuel: burn {0} in a Nuclear Power Plant"
					},
					"Translation":
					{
						"Text": "No recipe by design - spent fuel: burn {0} in a Nuclear Power Plant"
					},
					"Key": "GapSpentFuelFmt"
				},
				{
					"Source":
					{
						"Text": "Not built yet"
					},
					"Translation":
					{
						"Text": "Not built yet"
					},
					"Key": "StatusNotBuiltDefault"
				},
				{
					"Source":
					{
						"Text": "Not built yet"
					},
					"Translation":
					{
						"Text": "Not built yet"
					},
					"Key": "StatusNotBuilt"
				},
				{
					"Source":
					{
						"Text": "Not connected to a game"
					},
					"Translation":
					{
						"Text": "Not connected to a game"
					},
					"Key": "NoControllerHeadline"
				},
				{
					"Source":
					{
						"Text": "Nothing on your objective path has a production line yet."
					},
					"Translation":
					{
						"Text": "Nothing on your objective path has a production line yet."
					},
					"Key": "BalanceEmpty"
				},
				{
					"Source":
					{
						"Text": "Nothing produces it - build a line"
					},
					"Translation":
					{
						"Text": "Nothing produces it - build a line"
					},
					"Key": "BlockNoProducer"
				},
				{
					"Source":
					{
						"Text": "ON TRACK - ~{0} min of production remain ({1} is the long pole)."
					},
					"Translation":
					{
						"Text": "ON TRACK - ~{0} min of production remain ({1} is the long pole)."
					},
					"Key": "VerdictEtaFmt"
				},
				{
					"Source":
					{
						"Text": "Only {0}/min is available for {1}/min needed ({2}%); some delivery routes could not be checked"
					},
					"Translation":
					{
						"Text": "Only {0}/min is available for {1}/min needed ({2}%); some delivery routes could not be checked"
					},
					"Key": "LimiterAggFmt"
				},
				{
					"Source":
					{
						"Text": "Only {0}/min is getting through; the machines on this line need {1}/min ({2}%)"
					},
					"Translation":
					{
						"Text": "Only {0}/min is getting through; the machines on this line need {1}/min ({2}%)"
					},
					"Key": "LimiterSolvedFmt"
				},
				{
					"Source":
					{
						"Text": "Only {0}/min is reaching this line; it needs {1}/min"
					},
					"Translation":
					{
						"Text": "Only {0}/min is reaching this line; it needs {1}/min"
					},
					"Key": "BlockSolvedSupplyFmt"
				},
				{
					"Source":
					{
						"Text": "Only {0}/min is reaching this line; it needs {1}/min - add or upgrade extraction"
					},
					"Translation":
					{
						"Text": "Only {0}/min is reaching this line; it needs {1}/min - add or upgrade extraction"
					},
					"Key": "BlockSolvedExtractFmt"
				},
				{
					"Source":
					{
						"Text": "Outputs full"
					},
					"Translation":
					{
						"Text": "Outputs full"
					},
					"Key": "BlockOutputsFull"
				},
				{
					"Source":
					{
						"Text": "Outputs full - {0} has no connected destination and may be backing up (check its disposal)"
					},
					"Translation":
					{
						"Text": "Outputs full - {0} has no connected destination and may be backing up (check its disposal)"
					},
					"Key": "BlockByproductFmt"
				},
				{
					"Source":
					{
						"Text": "Outputs full - {0} of {1} machine(s) stalled"
					},
					"Translation":
					{
						"Text": "Outputs full - {0} of {1} machine(s) stalled"
					},
					"Key": "BlockOutputsFullFmt"
				},
				{
					"Source":
					{
						"Text": "Owned: {0} in storage  ·  {1} in depot  ·  {2} carried"
					},
					"Translation":
					{
						"Text": "Owned: {0} in storage  ·  {1} in depot  ·  {2} carried"
					},
					"Key": "TipOwnedFmt"
				},
				{
					"Source":
					{
						"Text": "PATH"
					},
					"Translation":
					{
						"Text": "PATH"
					},
					"Key": "TabPath"
				},
				{
					"Source":
					{
						"Text": "PAUSED"
					},
					"Translation":
					{
						"Text": "PAUSED"
					},
					"Key": "BalanceProblemPaused"
				},
				{
					"Source":
					{
						"Text": "PLAN"
					},
					"Translation":
					{
						"Text": "PLAN"
					},
					"Key": "TabPlan"
				},
				{
					"Source":
					{
						"Text": "POWER SHARDS"
					},
					"Translation":
					{
						"Text": "POWER SHARDS"
					},
					"Key": "BalanceAugmentShards"
				},
				{
					"Source":
					{
						"Text": "PRODUCED ELSEWHERE · this item is made somewhere in your factory, but no belt or pipe route reaches this line. If a teleporter, portal or loader feeds it, that link cannot be followed"
					},
					"Translation":
					{
						"Text": "PRODUCED ELSEWHERE · this item is made somewhere in your factory, but no belt or pipe route reaches this line. If a teleporter, portal or loader feeds it, that link cannot be followed"
					},
					"Key": "BalanceProducedElsewhere"
				},
				{
					"Source":
					{
						"Text": "PRODUCER ISSUES · {0} missing input · {1} output blocked · {2} no power"
					},
					"Translation":
					{
						"Text": "PRODUCER ISSUES · {0} missing input · {1} output blocked · {2} no power"
					},
					"Key": "BalanceProducerIssueFmt"
				},
				{
					"Source":
					{
						"Text": "PRODUCERS"
					},
					"Translation":
					{
						"Text": "PRODUCERS"
					},
					"Key": "BalanceProducersHeading"
				},
				{
					"Source":
					{
						"Text": "Pipe bottleneck: {0} → {1} carries {2} of {3}"
					},
					"Translation":
					{
						"Text": "Pipe bottleneck: {0} → {1} carries {2} of {3}"
					},
					"Key": "LimiterPipeConstraintFmt"
				},
				{
					"Source":
					{
						"Text": "Producers have no power"
					},
					"Translation":
					{
						"Text": "Producers have no power"
					},
					"Key": "BlockNoPower"
				},
				{
					"Source":
					{
						"Text": "Producing at {0}/min"
					},
					"Translation":
					{
						"Text": "Producing at {0}/min"
					},
					"Key": "TipRateFmt"
				},
				{
					"Source":
					{
						"Text": "Production exists, but none reaches the machines that need it"
					},
					"Translation":
					{
						"Text": "Production exists, but none reaches the machines that need it"
					},
					"Key": "BlockSolvedNotConnected"
				},
				{
					"Source":
					{
						"Text": "READY - every remaining part is banked. Delivery is the only step left."
					},
					"Translation":
					{
						"Text": "READY - every remaining part is banked. Delivery is the only step left."
					},
					"Key": "VerdictReady"
				},
				{
					"Source":
					{
						"Text": "REFRESH"
					},
					"Translation":
					{
						"Text": "REFRESH"
					},
					"Key": "RefreshReport"
				},
				{
					"Source":
					{
						"Text": "Raw resource - extract it"
					},
					"Translation":
					{
						"Text": "Raw resource - extract it"
					},
					"Key": "PlanRaw"
				},
				{
					"Source":
					{
						"Text": "Ready to deliver"
					},
					"Translation":
					{
						"Text": "Ready to deliver"
					},
					"Key": "StatusReadyToDeliver"
				},
				{
					"Source":
					{
						"Text": "Recipe locked - no purchasable research yet"
					},
					"Translation":
					{
						"Text": "Recipe locked - no purchasable research yet"
					},
					"Key": "GapNoUnlock"
				},
				{
					"Source":
					{
						"Text": "Recipe locked - research: {0}"
					},
					"Translation":
					{
						"Text": "Recipe locked - research: {0}"
					},
					"Key": "GapUnlockFmt"
				},
				{
					"Source":
					{
						"Text": "Recipe locked - research: {0} ({1})"
					},
					"Translation":
					{
						"Text": "Recipe locked - research: {0} ({1})"
					},
					"Key": "GapUnlockSrcFmt"
				},
				{
					"Source":
					{
						"Text": "Recipe not researched"
					},
					"Translation":
					{
						"Text": "Recipe not researched"
					},
					"Key": "StatusRecipeLocked"
				},
				{
					"Source":
					{
						"Text": "Recipe not researched"
					},
					"Translation":
					{
						"Text": "Recipe not researched"
					},
					"Key": "PlanLocked"
				},
				{
					"Source":
					{
						"Text": "Research needed upstream"
					},
					"Translation":
					{
						"Text": "Research needed upstream"
					},
					"Key": "SectionResearch"
				},
				{
					"Source":
					{
						"Text": "Research: {0}"
					},
					"Translation":
					{
						"Text": "Research: {0}"
					},
					"Key": "StatusResearchFmt"
				},
				{
					"Source":
					{
						"Text": "Reserve line (standby)"
					},
					"Translation":
					{
						"Text": "Reserve line (standby)"
					},
					"Key": "StatusStandbyReserve"
				},
				{
					"Source":
					{
						"Text": "Route not measured"
					},
					"Translation":
					{
						"Text": "Route not measured"
					},
					"Key": "StatusRouteUnknown"
				},
				{
					"Source":
					{
						"Text": "SERVING CURRENT USE · consumers are using about {0} against {1} demand"
					},
					"Translation":
					{
						"Text": "SERVING CURRENT USE · consumers are using about {0} against {1} demand"
					},
					"Key": "BalanceObservedUseHealthyFmt"
				},
				{
					"Source":
					{
						"Text": "SOMERSLOOPS"
					},
					"Translation":
					{
						"Text": "SOMERSLOOPS"
					},
					"Key": "BalanceAugmentSloops"
				},
				{
					"Source":
					{
						"Text": "STALE - {0}s old (refresh failed)"
					},
					"Translation":
					{
						"Text": "STALE - {0}s old (refresh failed)"
					},
					"Key": "AgeStaleFmt"
				},
				{
					"Source":
					{
						"Text": "STOCKPILING FOR YOUR OBJECTIVE · no machine draws this; you deliver it yourself"
					},
					"Translation":
					{
						"Text": "STOCKPILING FOR YOUR OBJECTIVE · no machine draws this; you deliver it yourself"
					},
					"Key": "BalanceObjectiveStock"
				},
				{
					"Source":
					{
						"Text": "SUPPLY LINE  can send {0}  ·  actually arriving {1}"
					},
					"Translation":
					{
						"Text": "SUPPLY LINE  can send {0}  ·  actually arriving {1}"
					},
					"Key": "BalanceModelFmt"
				},
				{
					"Source":
					{
						"Text": "SUPPLY MEETS NEED · {0} is reaching consumers; they need {1}"
					},
					"Translation":
					{
						"Text": "SUPPLY MEETS NEED · {0} is reaching consumers; they need {1}"
					},
					"Key": "BalanceModeledHealthyFmt"
				},
				{
					"Source":
					{
						"Text": "Saturated (surplus)"
					},
					"Translation":
					{
						"Text": "Saturated (surplus)"
					},
					"Key": "StatusSaturated"
				},
				{
					"Source":
					{
						"Text": "Search items or buildings, then press Enter"
					},
					"Translation":
					{
						"Text": "Search items or buildings, then press Enter"
					},
					"Key": "BalanceFilterHint"
				},
				{
					"Source":
					{
						"Text": "Separate track:"
					},
					"Translation":
					{
						"Text": "Separate track:"
					},
					"Key": "PlanExcludedLead"
				},
				{
					"Source":
					{
						"Text": "Showing the {0} lines needing the most attention, of {1} feeding your objective. Search, or filter by problem, to narrow this down."
					},
					"Translation":
					{
						"Text": "Showing the {0} lines needing the most attention, of {1} feeding your objective. Search, or filter by problem, to narrow this down."
					},
					"Key": "BalanceRowsTruncatedFmt"
				},
				{
					"Source":
					{
						"Text": "Showing the {0} lines needing the most attention, of {1} matching your filter."
					},
					"Translation":
					{
						"Text": "Showing the {0} lines needing the most attention, of {1} matching your filter."
					},
					"Key": "BalanceRowsTruncatedFilteredFmt"
				},
				{
					"Source":
					{
						"Text": "Showing {0} of {1} - the rest are counted in the totals above but not listed."
					},
					"Translation":
					{
						"Text": "Showing {0} of {1} - the rest are counted in the totals above but not listed."
					},
					"Key": "BalanceEndpointsTruncatedFmt"
				},
				{
					"Source":
					{
						"Text": "Spent fuel - burn {0} in a Nuclear Power Plant"
					},
					"Translation":
					{
						"Text": "Spent fuel - burn {0} in a Nuclear Power Plant"
					},
					"Key": "PlanSpentFuelFmt"
				},
				{
					"Source":
					{
						"Text": "Starved - the delivery path could not be fully checked; inspect its connections"
					},
					"Translation":
					{
						"Text": "Starved - the delivery path could not be fully checked; inspect its connections"
					},
					"Key": "BlockConnectivityUnknown"
				},
				{
					"Source":
					{
						"Text": "Still needed: {0}  (banked {1}, to produce {2})"
					},
					"Translation":
					{
						"Text": "Still needed: {0}  (banked {1}, to produce {2})"
					},
					"Key": "TipNeededFmt"
				},
				{
					"Source":
					{
						"Text": "Supply {0}/min vs demand {1}/min - add capacity"
					},
					"Translation":
					{
						"Text": "Supply {0}/min vs demand {1}/min - add capacity"
					},
					"Key": "BlockSupplyFmt"
				},
				{
					"Source":
					{
						"Text": "The feeding line could not be identified - inspect the connected producers"
					},
					"Translation":
					{
						"Text": "The feeding line could not be identified - inspect the connected producers"
					},
					"Key": "BlockPathAttributionMissing"
				},
				{
					"Source":
					{
						"Text": "The host cannot send a report"
					},
					"Translation":
					{
						"Text": "The host cannot send a report"
					},
					"Key": "NoRelayHeadline"
				},
				{
					"Source":
					{
						"Text": "The host could not produce a report"
					},
					"Translation":
					{
						"Text": "The host could not produce a report"
					},
					"Key": "HostDeclinedHeadline"
				},
				{
					"Source":
					{
						"Text": "The machines can supply {0}, but only {1} reaches consumers; inspect the route between them"
					},
					"Translation":
					{
						"Text": "The machines can supply {0}, but only {1} reaches consumers; inspect the route between them"
					},
					"Key": "LimiterRoutingConstraintFmt"
				},
				{
					"Source":
					{
						"Text": "This client asked the host for a report, but the host is not running a version of Critical Path that can send one. Ask the host to update, or open the panel on the host."
					},
					"Translation":
					{
						"Text": "This client asked the host for a report, but the host is not running a version of Critical Path that can send one. Ask the host to update, or open the panel on the host."
					},
					"Key": "NoRelayDetail"
				},
				{
					"Source":
					{
						"Text": "This reading is out of date - press REFRESH"
					},
					"Translation":
					{
						"Text": "This reading is out of date - press REFRESH"
					},
					"Key": "BlockLegacyLogistics"
				},
				{
					"Source":
					{
						"Text": "Time-limited"
					},
					"Translation":
					{
						"Text": "Time-limited"
					},
					"Key": "StatusTimeLimited"
				},
				{
					"Source":
					{
						"Text": "To research {0}  ({1}):"
					},
					"Translation":
					{
						"Text": "To research {0}  ({1}):"
					},
					"Key": "ResearchPlanHeadFmt"
				},
				{
					"Source":
					{
						"Text": "Transport route is known; vehicle throughput is not yet measured."
					},
					"Translation":
					{
						"Text": "Transport route is known; vehicle throughput is not yet measured."
					},
					"Key": "TransportTopologyOnly"
				},
				{
					"Source":
					{
						"Text": "Under-supplied"
					},
					"Translation":
					{
						"Text": "Under-supplied"
					},
					"Key": "StatusUnderSupplied"
				},
				{
					"Source":
					{
						"Text": "Unlocked by {0} - your SELECTED milestone: its payment progress is the Milestone column →"
					},
					"Translation":
					{
						"Text": "Unlocked by {0} - your SELECTED milestone: its payment progress is the Milestone column →"
					},
					"Key": "ResearchIsSelectedFmt"
				},
				{
					"Source":
					{
						"Text": "Vehicle route connected - delivery rate unknown because throughput is not yet measured"
					},
					"Translation":
					{
						"Text": "Vehicle route connected - delivery rate unknown because throughput is not yet measured"
					},
					"Key": "BlockTransportRateUnknown"
				},
				{
					"Source":
					{
						"Text": "blocked by {0} on the belt"
					},
					"Translation":
					{
						"Text": "blocked by {0} on the belt"
					},
					"Key": "EndpointStateJammedFmt"
				},
				{
					"Source":
					{
						"Text": "buffer {0} {1}"
					},
					"Translation":
					{
						"Text": "buffer {0} {1}"
					},
					"Key": "EndpointBufferFmt"
				},
				{
					"Source":
					{
						"Text": "downstream node"
					},
					"Translation":
					{
						"Text": "downstream node"
					},
					"Key": "LimiterEdgeDownstreamFallback"
				},
				{
					"Source":
					{
						"Text": "from the host, earlier (latest request failed)"
					},
					"Translation":
					{
						"Text": "from the host, earlier (latest request failed)"
					},
					"Key": "AgeHostStale"
				},
				{
					"Source":
					{
						"Text": "from the host, just now"
					},
					"Translation":
					{
						"Text": "from the host, just now"
					},
					"Key": "AgeFromHost"
				},
				{
					"Source":
					{
						"Text": "hard drive"
					},
					"Translation":
					{
						"Text": "hard drive"
					},
					"Key": "SrcHardDrive"
				},
				{
					"Source":
					{
						"Text": "idle - no fault reported"
					},
					"Translation":
					{
						"Text": "idle - no fault reported"
					},
					"Key": "EndpointStateIdle"
				},
				{
					"Source":
					{
						"Text": "is not in this plan - its recipe is not unlocked yet"
					},
					"Translation":
					{
						"Text": "is not in this plan - its recipe is not unlocked yet"
					},
					"Key": "PlanExcludedWhyUnknown"
				},
				{
					"Source":
					{
						"Text": "is not in this plan - its recipe unlocks with {0}"
					},
					"Translation":
					{
						"Text": "is not in this plan - its recipe unlocks with {0}"
					},
					"Key": "PlanExcludedWhyFmt"
				},
				{
					"Source":
					{
						"Text": "items"
					},
					"Translation":
					{
						"Text": "items"
					},
					"Key": "BufferItems"
				},
				{
					"Source":
					{
						"Text": "items"
					},
					"Translation":
					{
						"Text": "items"
					},
					"Key": "EndpointBufferItems"
				},
				{
					"Source":
					{
						"Text": "items/min"
					},
					"Translation":
					{
						"Text": "items/min"
					},
					"Key": "BalanceSolidRateUnit"
				},
				{
					"Source":
					{
						"Text": "just now"
					},
					"Translation":
					{
						"Text": "just now"
					},
					"Key": "AgeJustNowFlow"
				},
				{
					"Source":
					{
						"Text": "just now"
					},
					"Translation":
					{
						"Text": "just now"
					},
					"Key": "AgeJustNow"
				},
				{
					"Source":
					{
						"Text": "machine"
					},
					"Translation":
					{
						"Text": "machine"
					},
					"Key": "LimiterMachineFallback"
				},
				{
					"Source":
					{
						"Text": "made by {0}  ·  used by {1}{2}"
					},
					"Translation":
					{
						"Text": "made by {0}  ·  used by {1}{2}"
					},
					"Key": "BalanceIdentityFmt"
				},
				{
					"Source":
					{
						"Text": "milestone"
					},
					"Translation":
					{
						"Text": "milestone"
					},
					"Key": "SrcMilestone"
				},
				{
					"Source":
					{
						"Text": "missing input"
					},
					"Translation":
					{
						"Text": "missing input"
					},
					"Key": "EndpointStateMissingInput"
				},
				{
					"Source":
					{
						"Text": "m³"
					},
					"Translation":
					{
						"Text": "m³"
					},
					"Key": "EndpointBufferM3"
				},
				{
					"Source":
					{
						"Text": "m³"
					},
					"Translation":
					{
						"Text": "m³"
					},
					"Key": "BufferM3"
				},
				{
					"Source":
					{
						"Text": "m³/min"
					},
					"Translation":
					{
						"Text": "m³/min"
					},
					"Key": "BalanceFluidRateUnit"
				},
				{
					"Source":
					{
						"Text": "no connected consumer"
					},
					"Translation":
					{
						"Text": "no connected consumer"
					},
					"Key": "BalanceNoConsumer"
				},
				{
					"Source":
					{
						"Text": "no data - {0}"
					},
					"Translation":
					{
						"Text": "no data - {0}"
					},
					"Key": "AgeErrorFmt"
				},
				{
					"Source":
					{
						"Text": "no power"
					},
					"Translation":
					{
						"Text": "no power"
					},
					"Key": "EndpointStateNoPower"
				},
				{
					"Source":
					{
						"Text": "no producer"
					},
					"Translation":
					{
						"Text": "no producer"
					},
					"Key": "BalanceNoProducer"
				},
				{
					"Source":
					{
						"Text": "output full (nothing taking it)"
					},
					"Translation":
					{
						"Text": "output full (nothing taking it)"
					},
					"Key": "EndpointStateOutputBlocked"
				},
				{
					"Source":
					{
						"Text": "paused"
					},
					"Translation":
					{
						"Text": "paused"
					},
					"Key": "EndpointStatePaused"
				},
				{
					"Source":
					{
						"Text": "producing"
					},
					"Translation":
					{
						"Text": "producing"
					},
					"Key": "EndpointStateProducing"
				},
				{
					"Source":
					{
						"Text": "re-measuring..."
					},
					"Translation":
					{
						"Text": "re-measuring..."
					},
					"Key": "AgeRefreshing"
				},
				{
					"Source":
					{
						"Text": "state unavailable"
					},
					"Translation":
					{
						"Text": "state unavailable"
					},
					"Key": "EndpointStateUnavailable"
				},
				{
					"Source":
					{
						"Text": "the {0} elevator phase"
					},
					"Translation":
					{
						"Text": "the {0} elevator phase"
					},
					"Key": "PlanForPhaseFmt"
				},
				{
					"Source":
					{
						"Text": "the {0} milestone"
					},
					"Translation":
					{
						"Text": "the {0} milestone"
					},
					"Key": "PlanForMilestoneFmt"
				},
				{
					"Source":
					{
						"Text": "unavailable here"
					},
					"Translation":
					{
						"Text": "unavailable here"
					},
					"Key": "AgeUnavailable"
				},
				{
					"Source":
					{
						"Text": "upstream node"
					},
					"Translation":
					{
						"Text": "upstream node"
					},
					"Key": "LimiterEdgeUpstreamFallback"
				},
				{
					"Source":
					{
						"Text": "waiting on {0}"
					},
					"Translation":
					{
						"Text": "waiting on {0}"
					},
					"Key": "EndpointStateStarvedFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  Add 1 average {1} → about {2} reaching consumers ({3}%)"
					},
					"Translation":
					{
						"Text": "{0}  ·  Add 1 average {1} → about {2} reaching consumers ({3}%)"
					},
					"Key": "LimiterExactMachineMarginalFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  Alt recipes exist"
					},
					"Translation":
					{
						"Text": "{0}  ·  Alt recipes exist"
					},
					"Key": "PlanAltFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  Spare capacity unavailable - one or more routes could not be fully measured"
					},
					"Translation":
					{
						"Text": "{0}  ·  Spare capacity unavailable - one or more routes could not be fully measured"
					},
					"Key": "PlanGraftUnknownFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  Spare {1}/min, needs {2}/min ({3}%)"
					},
					"Translation":
					{
						"Text": "{0}  ·  Spare {1}/min, needs {2}/min ({3}%)"
					},
					"Key": "PlanGraftRatioFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  Stored buffer covers ~{1} min"
					},
					"Translation":
					{
						"Text": "{0}  ·  Stored buffer covers ~{1} min"
					},
					"Key": "LimiterBufferFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  Stored buffer is dry"
					},
					"Translation":
					{
						"Text": "{0}  ·  Stored buffer is dry"
					},
					"Key": "LimiterBufferDryFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  Upgrade this belt to {1} → about {2} reaching consumers ({3}%)"
					},
					"Translation":
					{
						"Text": "{0}  ·  Upgrade this belt to {1} → about {2} reaching consumers ({3}%)"
					},
					"Key": "LimiterExactBeltMarginalFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  Upgrade this pipe to {1} → about {2} reaching consumers ({3}%)"
					},
					"Translation":
					{
						"Text": "{0}  ·  Upgrade this pipe to {1} → about {2} reaching consumers ({3}%)"
					},
					"Key": "LimiterExactPipeMarginalFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  delivery rate unknown on {1} route(s)"
					},
					"Translation":
					{
						"Text": "{0}  ·  delivery rate unknown on {1} route(s)"
					},
					"Key": "LimiterUnknownFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  line {1}"
					},
					"Translation":
					{
						"Text": "{0}  ·  line {1}"
					},
					"Key": "BalanceTitleMultiFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  more not shown"
					},
					"Translation":
					{
						"Text": "{0}  ·  more not shown"
					},
					"Key": "PlanTruncFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  one more {1} would reach {2}%"
					},
					"Translation":
					{
						"Text": "{0}  ·  one more {1} would reach {2}%"
					},
					"Key": "LimiterMarginalFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  only {1} of {2} checked - too many to scan"
					},
					"Translation":
					{
						"Text": "{0}  ·  only {1} of {2} checked - too many to scan"
					},
					"Key": "TruncFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  {1}"
					},
					"Translation":
					{
						"Text": "{0}  ·  {1}"
					},
					"Key": "LimiterConstraintJoinFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  {1} checked - some supporting detail limited"
					},
					"Translation":
					{
						"Text": "{0}  ·  {1} checked - some supporting detail limited"
					},
					"Key": "TruncDetailFmt"
				},
				{
					"Source":
					{
						"Text": "{0}  ·  {1}: {2}"
					},
					"Translation":
					{
						"Text": "{0}  ·  {1}: {2}"
					},
					"Key": "VerdictPlanFaultFmt"
				},
				{
					"Source":
					{
						"Text": "{0} ({1})"
					},
					"Translation":
					{
						"Text": "{0} ({1})"
					},
					"Key": "PlanUnlockNameFmt"
				},
				{
					"Source":
					{
						"Text": "{0} - {1}"
					},
					"Translation":
					{
						"Text": "{0} - {1}"
					},
					"Key": "BalanceAnchorPingFmt"
				},
				{
					"Source":
					{
						"Text": "{0} - {1} - {2}"
					},
					"Translation":
					{
						"Text": "{0} - {1} - {2}"
					},
					"Key": "BalanceEndpointPingFmt"
				},
				{
					"Source":
					{
						"Text": "{0} delivered"
					},
					"Translation":
					{
						"Text": "{0} delivered"
					},
					"Key": "SummaryDoneFmt"
				},
				{
					"Source":
					{
						"Text": "{0} delivered"
					},
					"Translation":
					{
						"Text": "{0} delivered"
					},
					"Key": "LedgerDeliveredFmt"
				},
				{
					"Source":
					{
						"Text": "{0} need a fix"
					},
					"Translation":
					{
						"Text": "{0} need a fix"
					},
					"Key": "SummaryBlockedFmt"
				},
				{
					"Source":
					{
						"Text": "{0} needed  ·  {0} banked  ·  {1}"
					},
					"Translation":
					{
						"Text": "{0} needed  ·  {0} banked  ·  {1}"
					},
					"Key": "LedgerBankedFmt"
				},
				{
					"Source":
					{
						"Text": "{0} needed  ·  {1}"
					},
					"Translation":
					{
						"Text": "{0} needed  ·  {1}"
					},
					"Key": "LedgerNoBankFmt"
				},
				{
					"Source":
					{
						"Text": "{0} needed  ·  {1} banked  ·  {2}"
					},
					"Translation":
					{
						"Text": "{0} needed  ·  {1} banked  ·  {2}"
					},
					"Key": "ResearchCostLedgerFmt"
				},
				{
					"Source":
					{
						"Text": "{0} needed  ·  {1} banked  ·  {2} to produce  ·  {3}"
					},
					"Translation":
					{
						"Text": "{0} needed  ·  {1} banked  ·  {2} to produce  ·  {3}"
					},
					"Key": "LedgerFullFmt"
				},
				{
					"Source":
					{
						"Text": "{0} ready to deliver"
					},
					"Translation":
					{
						"Text": "{0} ready to deliver"
					},
					"Key": "SummaryReadyFmt"
				},
				{
					"Source":
					{
						"Text": "{0} still to build"
					},
					"Translation":
					{
						"Text": "{0} still to build"
					},
					"Key": "SummaryToBuildFmt"
				},
				{
					"Source":
					{
						"Text": "{0} {0}|plural(one=part,other=parts)"
					},
					"Translation":
					{
						"Text": "{0} {0}|plural(one=part,other=parts)"
					},
					"Key": "SummaryPartsFmt"
				},
				{
					"Source":
					{
						"Text": "{0} {1}"
					},
					"Translation":
					{
						"Text": "{0} {1}"
					},
					"Key": "BalanceRateWithUnitFmt"
				},
				{
					"Source":
					{
						"Text": "{0}% productivity"
					},
					"Translation":
					{
						"Text": "{0}% productivity"
					},
					"Key": "EndpointProductivityFmt"
				},
				{
					"Source":
					{
						"Text": "{0})  Build:"
					},
					"Translation":
					{
						"Text": "{0})  Build:"
					},
					"Key": "PlanStepBuildFmt"
				},
				{
					"Source":
					{
						"Text": "{0})  Fix:"
					},
					"Translation":
					{
						"Text": "{0})  Fix:"
					},
					"Key": "PlanStepFixFmt"
				},
				{
					"Source":
					{
						"Text": "{0})  Unlock:"
					},
					"Translation":
					{
						"Text": "{0})  Unlock:"
					},
					"Key": "PlanStepUnlockFmt"
				},
				{
					"Source":
					{
						"Text": "{0}. {1} - {2}"
					},
					"Translation":
					{
						"Text": "{0}. {1} - {2}"
					},
					"Key": "BalanceEndpointFmt"
				},
				{
					"Source":
					{
						"Text": "~{0} min remaining"
					},
					"Translation":
					{
						"Text": "~{0} min remaining"
					},
					"Key": "StatusEtaFmt"
				},
				{
					"Source":
					{
						"Text": "→ for {0}"
					},
					"Translation":
					{
						"Text": "→ for {0}"
					},
					"Key": "PlanItemForFmt"
				},
				{
					"Source":
					{
						"Text": "→ makes {0} buildable"
					},
					"Translation":
					{
						"Text": "→ makes {0} buildable"
					},
					"Key": "PlanUnlockMakesFmt"
				},
				{
					"Source":
					{
						"Text": "▼"
					},
					"Translation":
					{
						"Text": "▼"
					},
					"Key": "BalanceExpandChevron"
				}
			]
		}
	]
}